# -*- coding: utf-8 -*-


class Config(object):
    # 密码 string
    SECRET_KEY = 'showmethemoney'
    # 服务器名称
    HEADER_SERVER = 'SX-KakouRestServer'
    # 加密次数 int
    ROUNDS = 123456
    # token生存周期，默认2小时 int
    EXPIRES = 7200
    # 数据库连接 string
    SQLALCHEMY_DATABASE_URI = 'sqlite:///../kakou.db'
    # 数据库连接绑定 dict
    SQLALCHEMY_BINDS = {
        'kakou': 'oracle://abc:abc@123.123.123.123:1521/orcl'
    }
    # 连接池大小 int
    #SQLALCHEMY_POOL_SIZE = 10
    # 缓存类型
    CACHE_TYPE = 'simple'
    #CACHE_REDIS_HOST = 'db'
    #CACHE_REDIS_PORT = 6379
    #CACHE_REDIS_DB = 5
    #CACHE_REDIS_PASSWORD = ''
    # 缓存时间
    #CACHE_TIME = 60 * 30
    # 用户权限范围 dict
    SCOPE_USER = {}
    # 白名单启用 bool
    WHITE_LIST_OPEN = True
    # 白名单列表 set
    WHITE_LIST = set()
    # 图片服务器IP
    IMG_IP = {
    }
    # 号牌颜色ID
    HPYS2CODE = {
        '0': {'id': 0, 'code': 'WT', 'name': u'白牌'},
        '1': {'id': 1, 'code': 'YL', 'name': u'黄牌'},
        '2': {'id': 2, 'code': 'BU', 'name': u'蓝牌'},
        '3': {'id': 3, 'code': 'BK', 'name': u'黑牌'},
        '5': {'id': 4, 'code': 'GN', 'name': u'绿牌'},
        '4': {'id': 9, 'code': 'QT', 'name': u'其他'}
    }
    # 方向代码
    CODE2FXBH = {
        0: {'code': 'QT', 'name': u'其他'},
        1: {'code': 'EW', 'name': u'由东往西'},
        2: {'code': 'WE', 'name': u'由西往东'},
        3: {'code': 'SN', 'name': u'由南往北'},
        4: {'code': 'NS', 'name': u'由北往南'},
        5: {'code': 'ESWN', 'name': u'由东南往西北'},
        6: {'code': 'WNES', 'name': u'由西北往东南'},
        7: {'code': 'ENWS', 'name': u'由东北往西南'},
        8: {'code': 'WSEN', 'name': u'由西南往东北'},
        9: {'code': 'IN', 'name': u'进城'},
        10: {'code': 'OT', 'name': u'出城'}
    }
    # 卡口编号
    KKBH = {
        u'218': '441303301',
        u'36': '441303302',
        u'37': '441303303',
        u'153': '441303304',
        u'2059': '441303305',
        u'3242': '441303306',
        u'3210': '441303307',
        u'077': '441303308',
        u'108': '441303309',
        u'100': '441303310',
        u'112': '441303311',
        u'39': '441303312',
        u'066': '441303313',
        u'5334': '441303314',
        u'2037': '441303315',
        u'215': '441303316',
        u'144': '441303317',
        u'200': '441303318',
        u'198': '441303319',
        u'194': '441303320',
        u'6002': '441303321',
        u'66': '441303322',
        u'5618': '441303323',
        u'047': '441303324',
        u'070': '441303325',
        u'064': '441303326',
        u'096': '441303327',
        u'126': '441303328',
        u'163': '441303329',
        u'114': '441303330',
        u'82': '441303331',
        u'214': '441303332',
        u'242': '441303333',
        u'2053': '441303334',
        u'2226': '441303335',
        u'2082': '441303336',
        u'3220': '441303337',
        u'014': '441303338',
        u'119': '441303339',
        u'091': '441303340',
        u'110': '441303341',
        u'111': '441303342',
        u'018': '441303343',
        u'050': '441303344',
        u'2070': '441303345',
        u'3130': '441303346',
        u'3178': '441303347',
        u'202': '441303348',
        u'2182': '441303349',
        u'3226': '441303350',
        u'51': '441303351',
        u'056': '441303352',
        u'196': '441303353',
        u'167': '441303354',
        u'113': '441303355',
        u'35': '441303356',
        u'002': '441303357',
        u'160': '441303358',
        u'2009': '441303359',
        u'2024': '441303360',
        u'5674': '441303361'
    }


class Develop(Config):
    DEBUG = True


class Production(Config):
    DEBUG = False


class Testing(Config):
    TESTING = True
